alvaroserdotte/STM32-SERVO-FOC-PMSM-with-Encoder/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
//#include "nrf24l01.h"
#include "arm_math.h"
#include "nrf24.h"
uint8_t check;

extern float IUF,IVF,VBus,VFBK2,TempSTK; 
int I_PROT_COUNT = 15, Protect_I_Count = 0;
int I_PROTECTION = 1000;
uint32_t ADC_values[4];
extern int IU_OFFSET,IV_OFFSET;
float IUCALIB,IVCALIB,Data_Position,DataT;
float SP_spd,SP_q,SP_d;
char Status;
int Pos_int;
int POT = 0;
int IQM;
uint16_t Pos_uint;
const float SQRT13 =  0.5773502f;   //	1/sqrt(3)
const float SQRT23 =  1.1547005f;   //	2/sqrt(3)
const float SQRT32 = 	0.8660254f;  	//	sqrt(3)/2
const int SQRT32_INT = 28377;
const int SQRT13_INT = 18918;
const int SQRT23_INT = 37836;
const float PIRAD = 3.1415926f;
const float PIRAD_2 = 1.57079f;
typedef union {
		float f;
		unsigned char c[4];
}FloatU;
int ix;
typedef struct {
	int P;
	int I;
	int D;
	int P2;
	int SetPoint;
} Control_Parameter;

void INIT_ALL(void);
void PMSM_FOC(void);
int MAX(int v1,int v2,int v3);
int MIN(int v1,int v2,int v3);
void Trip(void);
static void error();
void example();
int delay;
short int Pos_degrees,Pos_elec,Pos_Sin,Pos_Cos;
short int SENO,SENO2;
uint16_t merda;

//float Pos_e;
Control_Parameter CSpd, CPosition, CCur;
int Va,Vb,Vc;
int Va2,Vb2,Vc2,Vm2,VaMAX;
//float ialfa,ibeta;
int Error_d,Iterm_d,Pterm_dTMP,Pterm_d;
int Error_q,Iterm_q,Pterm_q,Pterm_qTMP;
FloatU id,iq;
extern int IU,IV;
int ialfa_INT,ibeta_INT;
int Id,Iq;
int qLimit;
int qLimit2,qLimit3;
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
DMA_HandleTypeDef hdma_adc1;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_ADC1_Init(void);
static void MX_ADC2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */
void nRF24CSN_L(void) {
	HAL_GPIO_WritePin(nRF24_CSN_GPIO_Port,nRF24_CSN_Pin,0);
}
void nRF24CSN_H(void) {
	HAL_GPIO_WritePin(nRF24_CSN_GPIO_Port,nRF24_CSN_Pin,1);
}
void nRF24CE_L(void) {
	HAL_GPIO_WritePin(nRF24_CE_GPIO_Port,nRF24_CE_Pin,0);
}
void nRF24CE_H(void) {
	HAL_GPIO_WritePin(nRF24_CE_GPIO_Port,nRF24_CE_Pin,1);
}

void Trip(void){
	
	TIM1->CCER &= 0xEAAA;						//Disable OUTPUTS 1-6
	TIM1->CR1  &= 0xFFFE;						//STOP Counter
	TIM1->BDTR &= ~TIM_BDTR_MOE;
	HAL_NVIC_DisableIRQ(DMA1_Channel1_IRQn);
	HAL_NVIC_DisableIRQ(ADC1_2_IRQn);
	HAL_NVIC_DisableIRQ(USART1_IRQn);//USART1_IRQHandler	
	while (1)
	{
	  TIM1->BDTR &= ~TIM_BDTR_MOE;	//MASTER OUTPUT PWM
	}
	
}
void PMSM_FOC(void){
		HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin,1);
	if((delay > 10000) && (Status <= 'C')) {   
		//delay = 2 = 1ms/ 4000 = 2s
		
		delay++;
		if(delay < 24000) {
			
			if(delay > 10002) {
				TIM1->CCER |= 0x555;										//Enable OUTPUTS 1-6
				TIM1->BDTR |= TIM_BDTR_MOE;
			}
			if(delay > 14000) {
				TIM1->SR &= 0x7F;						//Clear Fault Break Status
				TIM1->BDTR |= 0x1000;				//Habilita Fault Break
				TIM1->DIER |= TIM_DIER_BIE;		//Ativa interrupt de Fault Break
				delay = 25000;
				
				if ((IUCALIB <= 30.0f) && (IVCALIB <= 30.0f)) {	//Ajusta Offset de corrente ACS712
					IU_OFFSET = IU_OFFSET - ((int) IUCALIB);
					IV_OFFSET = IV_OFFSET - ((int) IVCALIB);
					Status = 'B';
				}
				else {
					//Fault_OFFSET_I = 1;
					Status = 'O';		//OFFSET ERROR 
				}
				
			}
			TIM1->CCR1 = 3600/2 + (int) 450;		//Leg U
			TIM1->CCR2 = 3600/2 + (int) 0;		//Leg V
			TIM1->CCR3 = 3600/2 + (int) 0;		//Leg W
			TIM2->CNT = 0;
		}
		else {
		if(delay > 25000) delay = 25000;
			
		//Proteção
		//IU e IV
		//I_PROTECTION = 1000 = 12.08A
		
		
			
		if ((IU > I_PROTECTION) || (IV > I_PROTECTION) || (IU < -I_PROTECTION) || (IV < -I_PROTECTION)) Protect_I_Count++;
		else 	Protect_I_Count = 0;
		
		if (Protect_I_Count > I_PROT_COUNT) {		
			Status = 'I';	//Overcurrent
			//Fault_Overcurrent	= 1;
			Trip();
			return;
		}

		//Calculo da posição 8000p/Rotation
		Pos_elec = (TIM2->CNT*163835/10000) & 0x7FFF;				//angulo elétrico motor 4 Par de Polos
		Pos_degrees = (TIM2->CNT*40958/10000) & 0x7FFF;				//angulo mecanico
		Pos_Sin = arm_sin_q15(Pos_elec);
		Pos_Cos = arm_cos_q15(Pos_elec);
		//Pos_degrees =  Pos_elec / 4.0f;	//angulo degrees
		//Pos_int = sizeof(Pos_elec);
		//TIPO DE CONTROLE
		
		#define POSITION 	0
		#define SPEED 		0
		#define CURRENT 	1
		
		#define FIELDW 	0
		
				#if (POSITION) 	//Controle de Posição
			SP_pos 	= Sy;//SP_pos + (float)oi3*0.01f;
		#elif (CURRENT) 	//Controle de corrente
			SP_q		=(((float)POT) + SP_q*15)/16;
		#elif (SPEED) 	//Controle de RPM/Corrente
 				SP_spd	=(((float)POT/70) + SP_spd*15)/16;
			
		#endif
		
		//*******   A B C to Alpha Beta
		
		//ialfa = SQRT23*Iam - SQRT23*Ibm/2 - SQRT23*Icm/2; ia + ib + ic = 0 / ic = -ia -ib
		//ibeta = 0 + SQRT2_2*Ibm - SQRT2_2*Icm;

		
		ialfa_INT = IU;
		ibeta_INT = SQRT13_INT*IU/32767 + SQRT23_INT*IV/32767;
		
		//Alpha Beta to DQ
		
