alvaroserdotte/STM32-SERVO-FOC-PMSM-with-Encoder/Src/main.c
		Id = (Pos_Cos*ialfa_INT/32767) + (Pos_Sin*ibeta_INT/32767);
		Iq = -(Pos_Sin*ialfa_INT/32767) + (Pos_Cos*ibeta_INT/32767);
		
		IQM = (Iq*39599)/32767;
		//id.f =  (Pos_Cos*ialfa_INT/32767) + (Pos_Sin*ibeta_INT/32767);
		//iq.f = -(Pos_Sin*ialfa_INT/32767) + (Pos_Cos*ibeta_INT/32767);
		
		//*******   Current control 'D' part
		{
		#if (SPEED &&  FIELDW) 	//Controle de RPM/Corrente
			SP_d = (int)Z	;		//Field Weakening
			SP_d = SP_d/100.0f;
		#endif

		Error_d=SP_d-Id;
		Iterm_d = Iterm_d + Error_d*CCur.I/32767;					//+Iterm2_d;
		if (Iterm_d > 900) Iterm_d = 900;					//anti-windup
		else if (Iterm_d < -900) Iterm_d = -900;
		//Pterm_dTMP = Error_d*CCur.P.f;
		Pterm_d = Error_d*CCur.P/32767 + Iterm_d;				//Resultante Controle Corrente D

		if (Pterm_d > 900) Pterm_d = 900;					//Limitador Saída
		else if (Pterm_d < -900) Pterm_d = -900;
		}	
				
		//*******   Current control 'Q' part
		{
		arm_sqrt_q31(2250000 - (Pterm_d*Pterm_d),&qLimit);				//Limitador geométrico do 'q' baseado no Pterm_D
		qLimit = qLimit/46341;
		if (qLimit > 1500) qLimit = 1500;

		Error_q=SP_q-Iq;
			
		Iterm_q = Iterm_q + Error_q*CCur.I/32767;

		if (Iterm_q > qLimit) Iterm_q = qLimit;					//anti-windup
		else if (Iterm_q < -(qLimit)) Iterm_q = -qLimit;
		//Pterm_qTMP = Error_q*CCur.P.f;
		Pterm_q = Error_q*CCur.P/32767 + Iterm_q;				//Resultante Controle Corrente Q

		if (Pterm_q > qLimit) Pterm_q = qLimit;					//Limitador Saída
		else if (Pterm_q < -qLimit) Pterm_q = -qLimit;		
		
		//Q positivo Movimento ANTIHORARIO, Angulação aumenta (Positiva) +

		}
		
		ialfa_INT = (Pos_Cos*Pterm_d/32767) - (Pos_Sin*Pterm_q/32767);		
		ibeta_INT = (Pos_Sin*Pterm_d/32767) + (Pos_Cos*Pterm_q/32767);	
		
		Va = ialfa_INT;
		Vb = -ialfa_INT/2 + SQRT32_INT*ibeta_INT/32767;
		Vc = -ialfa_INT/2 - SQRT32_INT*ibeta_INT/32767;
		
		Vm2 = (MAX(Va,Vb,Vc) + MIN(Va,Vb,Vc))/2;
		Va2 = -Vm2 + Va;
		Vb2 = -Vm2 + Vb;
		Vc2 = -Vm2 + Vc;
		
		Status = 'C';	//Control Loop working
	
		if (VaMAX < Va2) {
			VaMAX = Va2;
		}
		
		TIM1->CCR1 = 1800 + (int) Va2;//Va;		//Leg A
		TIM1->CCR2 = 1800 + (int) Vb2;// + (int)Tabela[indiceB]*amp;		//Leg B
		TIM1->CCR3 = 1800 + (int) Vc2;// + (int)Tabela[indiceC]*amp;		//Leg C
				
	}
		
	}
		else {
		IUCALIB = (IU + IUCALIB*2000)/2001;
		IVCALIB = (IV + IVCALIB*2000)/2001;	
		delay++;
		}
		HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin,0);
}
int MAX(int v1,int v2,int v3) {
	if ((v1 >= v2) && (v1 >= v3)) {
		return v1;
	}
	else if ((v2 > v1) && (v2 > v3)) {
		return v2;
	}
	else {
		return v3;
	}
}
int MIN(int v1,int v2,int v3) {
	if ((v1 <= v2) && (v1 <= v3)) {
		return v1;
	}
	else if ((v2 < v1) && (v2 < v3)) {
		return v2;
	}
	else {
		return v3;
	}
}

uint32_t i,j,k;

// Buffer to store a payload of maximum width
uint8_t nRF24_payload[32];

// Pipe number
nRF24_RXResult pipe;

// Length of received payload
uint8_t payload_length;

void nRF24_GPIO_Init(void) {
int merda;
	merda= 1;
}

// Low level SPI transmit/receive function (hardware depended)
// input:
//   data - value to transmit via SPI
// return: value received from SPI
uint8_t nRF24_LL_RW(uint8_t data) {
	 // Wait until TX buffer is empty
	while ((SPI1->SR & SPI_SR_TXE) == 0);
	// Send byte to SPI (TXE cleared)
	SPI1->DR = data;
	//SPI_I2S_SendData(nRF24_SPI_PORT, data);
	// Wait while receive buffer is empty
	while ((SPI1->SR & SPI_SR_RXNE) == 0);

	// Return received byte
	return (uint8_t)SPI1->DR;
}

void INIT_ALL(void) {
	
	//SysTick_Config(1440); ////144000 -> 2ms
	//DMA INIT
			//ADC_DMA

	DMA1_Channel1->CNDTR = 2;															//Tamanho do dado
	DMA1_Channel1->CPAR = (uint32_t)&ADC12_COMMON->DR;
	DMA1_Channel1->CMAR = (uint32_t)&ADC_values;
	//DMA1_Channel1->CCR = 0x3AAB;	//Canal habilitado, FULL INT, HALFWORD	
	DMA1_Channel1->CCR |= DMA_CCR_EN;
	
	//ADC INIT
	HAL_ADCEx_Calibration_Start(&hadc1);
	HAL_ADCEx_Calibration_Start(&hadc2);

	
	ADC1->CR1 |= ADC_CR1_EOCIE;
	ADC1->CR2 = 0;
	ADC2->CR2 = 0;
	ADC1->CR2 |= ADC_CR2_DMA;
	ADC2->CR2 |= ADC_CR2_DMA;
	
	ADC1->CR2 |= ADC_CR2_ADON | ADC_CR2_EXTTRIG;
	ADC2->CR2 |= ADC_CR2_ADON | ADC_CR2_EXTTRIG;	
	
	// TIMER 1 PWM
	TIM1->CCER |= (TIM_CCER_CC1E | TIM_CCER_CC1NE | TIM_CCER_CC2E | TIM_CCER_CC2NE | TIM_CCER_CC3E | TIM_CCER_CC3NE);
	TIM1->DIER |= TIM_DIER_BIE;	//BREAK INTERRUPT
	TIM1->BDTR |= TIM_BDTR_MOE;	//MASTER OUTPUT PWM
	
	TIM1->CR1 |= TIM_CR1_CEN;		//TIMER EN
	
	//TIMER 2 ENCODER
	TIM2->CNT = 0;
	TIM2->ARR = 7999;//
	TIM2->CR1 |= TIM_CR1_CEN;		//TIMER EN
	
	IU_OFFSET = 2045;
	IV_OFFSET = 2035;
	Status = '0';	//Initial State
	
	CCur.P = 0.110f * 32767;		//15			//120				//1000	//300
	CCur.I = 0.0305f * 32767;		//10			//30				//30	//12
	
	//CSpd.P.f = 1.0f;			//0.5			//1
	//CSpd.I.f = 0.002f;		//0.0005		//0.008
	//CSpd.D.f = 0.05f;			//0.05		//0.5
	
	//CPosition.P.f = 0.01f;
	//CPosition.P2.f = 0.03f;
	//CPosition.I.f = 0.0002f;		//I when Locked
	//CPosition.D.f = 0.2f;			//P2 when locked
	SP_d = 0;
	SPI1->CR1 |= SPI_CR1_SPE;
	SPI1->CR2 |= SPI_CR2_RXNEIE;
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC1_Init();
  MX_ADC2_Init();
  MX_TIM1_Init();
  MX_TIM2_Init();
  MX_SPI1_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */
  
